/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   c12932.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kwon <kwon@student.42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/09/06 17:17:38 by kwon              #+#    #+#             */
/*   Updated: 2020/09/06 17:23:23 by kwon             ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

//자연수 뒤집어 배열로 만들기

#include <stdio.h>
#include <stdbool.h>
#include <stdlib.h>

int* solution(long long n) {
    // 리턴할 값은 메모리를 동적 할당해주세요.
    int* answer = (int*)malloc(20000);
    int i;

    i = 0;
    while(n != 0)
    {
        answer[i] = n%10;
        n /= 10;
        i++;
    }
    return answer;
}