/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   c15651.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kwon <kwon@student.42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/09/05 17:40:18 by kwon              #+#    #+#             */
/*   Updated: 2020/09/05 18:06:47 by kwon             ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

//백트래킹 N과 M (3)
//1부터 N까지 자연수 중에서 M개를 고른 수열
//같은 수를 여러 번 골라도 된다

#include <stdio.h>

int N, M;
int arr[10];

void    seq(int cnt)
{
    int i;
    int j;
    if(cnt == M)
    {
        j=0;
        while(j != M)
        {
            printf("%d ",arr[j]);
            j++;
        }
        printf("\n");
        return ;
    }
    i=1;
    while(i!=N+1)
    {
        arr[cnt] = i;
        seq(cnt+1);
        i++;
    }
}

int main()
{
    scanf("%d%d",&N,&M);
    seq(0);
    return 0;
}