/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   c15652.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kwon <kwon@student.42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/09/05 18:04:45 by kwon              #+#    #+#             */
/*   Updated: 2020/09/05 18:21:53 by kwon             ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

//백트래킹 N과 M (4)
//1부터 N까지 자연수 중에서 M개를 고른 수열
//같은 수를 여러 번 골라도 된다
//고른 수열은 비내림차순이어야 한다.
//길이가 K인 수열 A가 A1 ≤ A2 ≤ ... ≤ AK-1 ≤ AK를 만족하면, 비내림차순이라고 한다.

#include <stdio.h>

int N, M;
int arr[10];

void    seq(int cnt, int cur)
{
    int i;
    int j;
    if(cnt == M)
    {
        j=0;
        while(j != M)
        {
            printf("%d ",arr[j]);
            j++;
        }
        printf("\n");
        return ;
    }
    i=cur;
    while(i!=N+1)
    {
        arr[cnt] = i;
        seq(cnt+1, i);
        i++;
    }
}

int main()
{
    scanf("%d%d",&N,&M);
    seq(0,1);
    return 0;
}