/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   c12925.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kwon <kwon@student.42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/09/03 18:59:15 by kwon              #+#    #+#             */
/*   Updated: 2020/09/03 18:59:41 by kwon             ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

//문자열을 정수로 바꾸기
//문자열을 숫자로 반환 - atoi
#include <stdio.h>
#include <stdbool.h>
#include <stdlib.h>

// 파라미터로 주어지는 문자열은 const로 주어집니다. 변경하려면 문자열을 복사해서 사용하세요.
int solution(const char* s) {
    int answer = 0;
    int sign = 1;
    
    while(*s == '+' || *s == '-')
    {
        if(*s == '-')
            sign *= -1;
        s++;
    }
    while(*s >= '0' && *s <= '9')
    {
        answer = answer * 10 + *s -'0';
        s++;
    }
    answer = answer * sign;
    return answer;
       
}