/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   c12901.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kwon <kwon@student.42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/09/03 18:55:48 by kwon              #+#    #+#             */
/*   Updated: 2020/09/03 18:56:14 by kwon             ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

//2016년 요일계산
//2016 1월 1일을 금요일

#include <stdio.h>
#include <stdbool.h>
#include <stdlib.h>

char* solution(int a, int b) {
    // 리턴할 값은 메모리를 동적 할당해주세요.
    char* answer = (char*)malloc(4);
    char* day[7] = {"SUN","MON","TUE","WED","THU","FRI","SAT"};
    int mon[12] = {31,29,31,30,31,30,31,31,30,31,30,31};
    int i=0;
    
    while(i != a-1)
    {    
        b += mon[i];
        i++;
    }
    answer = day[(b+4) % 7];
    return answer;
}